---
kind: property
id: P:Autodesk.Revit.DB.Electrical.InsulationType.Name
source: html/d821a86d-0511-38e8-cfd0-6a1d2e2fd185.htm
---
# Autodesk.Revit.DB.Electrical.InsulationType.Name Property

Get name of Insulation type.

## Syntax (C#)
```csharp
public override string Name { set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Set name can't be supported.